artillery/request-all-urls-normal.yml
config:
  target: "http://localhost:8080"
  http:
    timeout: 600
  phases:
    - duration: 60
      arrivalRate: 2
    - duration: 120
      arrivalRate: 2
      rampTo: 5
    - duration: 420
      arrivalRate: 2
    - duration: 420
      arrivalRate: 3
    - duration: 420
      arrivalRate: 1
  environments:
    dev:
      target: "http://localhost:8080"
    skipHeader: true
  processor: "./utils.js"
scenarios:
  - name: "Fetch all urls ssociations"
    flow:
      - get:
          url: "/"
          afterResponse: "printErrorStatus"
        expect:
          - statusCode: 201
          - contentType: json
          - hasProperty: "uuid"
          - hasProperty: "url"