artillery/request-all-urls-super-insane.yml
config:
  target: "http://localhost:8080"
  http:
    timeout: 600
  phases:
    - duration: 60
      arrivalRate: 10
      name: Warm up
    - duration: 120
      arrivalRate: 10
      rampTo: 25
      name: Ramp up load
    - duration: 420
      arrivalRate: 20
      name: Sustained load
    - duration: 420
      arrivalRate: 25
      name: Heavy
    - duration: 420
      arrivalRate: 20
      rampTo: 25
      name: Crash
  environments:
    dev:
      target: "http://localhost:8080"
    skipHeader: true
  processor: "./utils.js"
scenarios:
  - name: "Fetch all urls ssociations"
    flow:
      - get:
          url: "/"
          afterResponse: "printErrorStatus"
        expect:
          - statusCode: 201
          - contentType: json
          - hasProperty: "uuid"
          - hasProperty: "url"